Ran Plan for dir: `terraform/atlantis` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # kubernetes_secret.tls will be created
+ resource "kubernetes_secret" "tls" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "wayofthesys-com-argocd-tls"
          + namespace        = "atlantis"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # random_id.encryption-key will be created
+ resource "random_id" "encryption-key" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 32
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # tls_cert_request.request will be created
+ resource "tls_cert_request" "request" {
      + cert_request_pem = (known after apply)
      + dns_names        = [
          + "atlantis",
          + "atlantis.local",
          + "atlantis.default.svc.cluster.local",
          + "localhost",
          + "argocd.wayofthesys.com",
        ]
      + id               = (known after apply)
      + ip_addresses     = [
          + "127.0.0.1",
          + "138.197.48.247",
        ]
      + key_algorithm    = "RSA"
      + private_key_pem  = (sensitive value)

      + subject {
          + common_name  = "argocd.wayofthesys.com"
          + organization = "Atlantis"
        }
    }

  # tls_locally_signed_cert.cert will be created
+ resource "tls_locally_signed_cert" "cert" {
      + allowed_uses          = [
          + "cert_signing",
          + "client_auth",
          + "digital_signature",
          + "key_encipherment",
          + "server_auth",
        ]
      + ca_cert_pem           = (known after apply)
      + ca_key_algorithm      = "RSA"
      + ca_private_key_pem    = (sensitive value)
      + cert_pem              = (known after apply)
      + cert_request_pem      = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + ready_for_renewal     = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 8760
      + validity_start_time   = (known after apply)
    }

  # tls_private_key.ca will be created
+ resource "tls_private_key" "ca" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

  # tls_private_key.key will be created
+ resource "tls_private_key" "key" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

  # tls_self_signed_cert.ca will be created
+ resource "tls_self_signed_cert" "ca" {
      + allowed_uses          = [
          + "cert_signing",
          + "digital_signature",
          + "key_encipherment",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + is_ca_certificate     = true
      + key_algorithm         = "RSA"
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 8760
      + validity_start_time   = (known after apply)

      + subject {
          + common_name  = "ca.local"
          + organization = "Atlantis"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Warning: Version constraints inside provider configuration blocks are deprecated

  on providers.tf line 12, in provider "digitalocean":
  12:   version = ">=1.5.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/atlantis`
* :put_litter_in_its_place: To **delete** this plan click [here](https://wayofthesys.com/lock?id=autotune%252Fpritunl-k8s-tf-do%252Fterraform%252Fatlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/atlantis`
</details>
Plan: 7 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
